# Найти факториал вводимого с клавиатуры числа

import math

num = int(input('Введите число: '))
print(math.factorial(num))
